<?php
if(isset($_GET['date'])) {
    $date = explode('-', $_GET['date']);
   if ((($date[1] == '03') && ($date[2]>='19')) || (($date[1] == '04') && ($date[2]<='20'))){
        echo "Овен";
    } elseif ((($date[1] == '04') && ($date[2]>='21')) || (($date[1] == '05') && ($date[2]<='20'))) {
        echo "Телец";
    } elseif ((($date[1] == '05') && ($date[2]>='21')) || (($date[1] == '06') && ($date[2]<='21'))) {
        echo "Близнецы";
    } elseif ((($date[1] == '06') && ($date[2]>='22')) || (($date[1] == '07') && ($date[2]<='22'))) {
        echo "Рак";
    } elseif ((($date[1] == '07') && ($date[2]>='23')) || (($date[1] == '08') && ($date[2]<='23'))) {
        echo "Лев";
    } elseif ((($date[1] == '08') && ($date[2]>='24')) || (($date[1] == '09') && ($date[2]<='23'))) {
        echo "Дева";
    } elseif ((($date[1] == '09') && ($date[2]>='24')) || (($date[1] == '10') && ($date[2]<='23'))) {
        echo "Весы";
    } elseif ((($date[1] == '10') && ($date[2]>='24')) || (($date[1] == '11') && ($date[2]<='22'))) {
        echo "Скорпион";
    } elseif ((($date[1] == '11') && ($date[2]>='23')) || (($date[1] == '12') && ($date[2]<='21'))) {
        echo "Стрелец";
    } elseif ((($date[1] == '12') && ($date[2]>='22')) || (($date[1] == '01') && ($date[2]<='20'))) {
        echo "Козерог";
    } elseif ((($date[1] == '01') && ($date[2]>='21')) || (($date[1] == '02') && ($date[2]<='20'))) {
        echo "Водолей";
    } else  {
        echo "Рыбы";
    } 
}