USE blog;

INSERT INTO
    `post` (`user_id`, `like`, `content`)
VALUES (
        '0',
        '22',
        'Так красиво сегодня на улице! Настоящая зима)) Вспоминается Бродский: «Поздно ночью, в уснувшей долине, на самом дне, в городке, занесенном снегом по ручку двери...» '
    ),
    (
        '1',
        '15',
        'Так красиво сегодня на улице!'
    ),
    (
        '1',
        '22',
        'Так красиво сегодня на улице! Настоящая зима)) Вспоминается Бродский: «Поздно ночью, в уснувшей долине, на самом дне, в городке, занесенном снегом по ручку двери...» '
    );